driver-tests/bpelse/misc/MiscJbi/test/ProcessAttrNameTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nam="urn:/NameInfo.wsdl">
  <soapenv:Body>
    <nam:NameRequest>
      <nam:text>ProcessAttributeNameTest</nam:text>
    </nam:NameRequest>
  </soapenv:Body>
</soapenv:Envelope>